{"adult":false,"also_known_as":["Eline Pauwels"],"biography":"Born Eline Pauwels on the 12th April 1990, in Leuven, Belgium, Eline is a prominent actress, best known to the world as Ryn in the fantasy drama series “Siren” (2018), and also as Bianca in the award-winning fantasy drama series “Game of Thrones”, back in 2016. Eline also starred in the comedy film “Stoner Express”, also in 2016.\n\nEline is the daughter of the famous Belgian pharmacologist, Rudi Pauwels and his wife Carine Claeys; her father is best known to the world for launching biotech companies, Tibotec and Vicro, both focused on bringing the HIV virus to a controlled state. Eline has a brother, but his identity remains unknown to the public. Elin fell in love with acting at a young age, and in high school appeared in several school plays, which gave her enough experience to study acting once she completed her high school education. She enrolled at the Royal Academy of Dramatic Arts, (RADA) London and earned her Bachelor of Arts degree in acting, with special skills in ballet, hip hop, singing, Flamenco and violin. Furthermore, Eline is proficient in Dutch, French and English languages, including American, South American, Irish and Estuary accents.\n\nShe started her career in a short student film For Elsie, where she played the role of Mila, a mobster's daughter who wants to learn the piano in one day. Her performance earned awards from the Beijing Student Film Festival and the Student Academy Awards, USA.  Also at the 39th Annual Student Academy Awards in 2012, For Elsie earned its director David Winstone the Foreign Film Gold Medal.\n\nIn 2012, she had a small role (Angelique) in Quartet, Dustin Hoffman's directorial debut.\n\nIn 2014, she played the title role in the Italian drama film Anita B. directed by Roberto Faenza. The 2014 Capri, Hollywood International Film Festival named Powell as that year's \"Breakout\" actress for her role in Anita B.. Hollywood Reporter, on the other hand, criticized that performance as \"ineffective..failing to convey any traces of the suffering her character has obviously endured.\"\n\nIn 2016, she appeared in two episodes of Game of Thrones as Bianca, a young actress plotting to murder her rival.\n\nShe had small roles in Novitiate and King Arthur: Legend of the Sword, both released in 2017.\n\nIn August 2016, Powell was cast to star in the Freeform series Siren playing Ryn, a feral mermaid who comes to a small coastal village in search of her sister.  Preparing for the role, Powell studied legends of mermaids and sea creatures.  To develop ideas for the mermaid's body language, Powell worked from videos of marine and other predators.[20][4][21] For the mermaid's newly learned speech, Powell was inspired by the accent of Icelandic singer Björk.\n\nSiren, which was the top new cable drama during spring 2018, was renewed in October for a second season, premiering on January 24, 2019.","birthday":"1989-04-12","id":1262627,"imdb_id":"nm4730958","name":"Eline Powell","place_of_birth":"Lovanio, Belgio","popularity":7.541,"profile_path":"/1ns3pxsZ7GfhJF2xxoAAuIN52iO.jpg","credits":{"cast":[{"id":228107,"title":"Anita B.","character":"Anita","original_title":"Anita B.","poster_path":"/kSP4MqjvLkuINd1ZTbY7ImURcll.jpg","release_date":"2014-01-28","adult":false},{"id":278313,"title":"Stoner Express","character":"Desiree","original_title":"Stoner Express","poster_path":"/nnp6QDj8SQg7efSIgv75rivCXP7.jpg","release_date":"2016-08-19","adult":false},{"id":411976,"title":"见习修女","character":"Sister Candace","original_title":"Novitiate","poster_path":"/eZ9BbRy4YGFM1yvx6ZDO7qzILJ.jpg","release_date":"2017-10-27","adult":false},{"id":143970,"title":"柑橘与柠檬啊","character":"Anna","original_title":"Private Peaceful","poster_path":"/cb5nlSWCDmIMPnZQl8nkP4VIDbj.jpg","release_date":"2012-10-12","adult":false},{"id":274857,"title":"亚瑟王：斗兽争霸","character":"Syren 2","original_title":"King Arthur: Legend of the Sword","poster_path":"/xtGLN6Lg0GqlkxUrniLKP3yAiwg.jpg","release_date":"2017-05-10","adult":false}],"crew":[]},"images":{"profiles":[{"file_path":"/dUpZGKpmX4kQ6480cYnO1QYn4T1.jpg","width":854,"height":1280,"aspect_ratio":0.6671875,"vote_average":5.172,"vote_count":1},{"file_path":"/yrOL226p4iZFRCgDWOLSFz3NnbG.jpg","width":301,"height":451,"aspect_ratio":0.66740576496674,"vote_average":5.312,"vote_count":1},{"file_path":"/1ns3pxsZ7GfhJF2xxoAAuIN52iO.jpg","width":500,"height":750,"aspect_ratio":0.66666666666667,"vote_average":5.312,"vote_count":1}]},"external_ids":{"imdb_id":"nm4730958","tvrage_id":0}}