{"adult":false,"also_known_as":[],"biography":"From Wikipedia, the free encyclopedia.\n\nSaadi Yacef (born January 20, 1928) was one of the leaders of Algeria's National Liberation Front during his country's war of independence. He is currently a Senator in Algeria's Council of the Nation.\n\nYacef was born in Algiers. He started his working life as an apprentice baker. In 1945 he joined the Parti du Peuple Algerien, a nationalist party which the French authorities soon outlawed, after which it was reconstituted as the Mouvement pour le Triomphe des Libertes Democratiques (MTLD). From 1947 to 1949 Yacef served in the MTLD's paramilitary wing, the Organisation Secrete. After the OS was broken up Yacef moved to France and lived there until 1952, when he returned to Algeria to work again as a baker.\n\nYacef joined the FLN at the start of the Algerian War in 1954. By May 1956 he was the FLN's military chief of the Zone Autonome d'Alger (Autonomous Zone of Algiers), making him one of the leaders on the Algerian side in the Battle of Algiers. He was captured by French troops on September 24, 1957 and eventually sentenced to death. General Paul Aussaresses later asserted that while in custody, Yacef Saadi betrayed the FLN and the Algerian cause by providing the French army with the location of Ali la Pointe, another leading FLN commander. Yacef has denied it, and historian Darius Rejali considers the accusation as highly suspect. He was ultimately pardoned by the French government after Charles de Gaulle's 1958 return to power.\n\nYacef claims to have written his memoirs of the battle while in Prison, although he was known for being an illiterate. The writings were published in 1962 as Souvenirs de la Bataille d'Alger. After the Algerian War, Yacef helped produce Gillo Pontecorvo's film The Battle of Algiers (1966), based on Souvenirs de la Bataille d'Alger. Yacef played a character modeled on his own experiences in the battle.\n\nDescription above from the Wikipedia article Saadi Yacef, licensed under CC-BY-SA, full list of contributors on Wikipedia.​","birthday":"1928-01-20","id":557864,"imdb_id":"nm0754272","name":"Yacef Saadi","place_of_birth":"Algiers, Algeria","popularity":0.6,"credits":{"cast":[{"id":17295,"title":"阿尔及尔之战","character":"Djafar","original_title":"La battaglia di Algeri","poster_path":"/9fHkCuYEKsu7j0xsI2HbBvlZNZc.jpg","release_date":"1966-09-08","adult":false},{"id":141564,"title":"Remembering History","character":"Himself","original_title":"Remembering History","release_date":"2004-10-12","adult":false},{"id":141562,"title":"Marxist Poetry: The Making of 'The Battle of Algiers'","character":"Himself","original_title":"Marxist Poetry: The Making of 'The Battle of Algiers'","release_date":"2004-08-01","adult":false}],"crew":[{"id":17295,"title":"阿尔及尔之战","original_title":"La battaglia di Algeri","department":"Production","job":"Producer","poster_path":"/9fHkCuYEKsu7j0xsI2HbBvlZNZc.jpg","release_date":"1966-09-08","adult":false}]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm0754272","tvrage_id":0}}