{"adult":false,"also_known_as":[],"biography":"Wesley Thompson (born October 2, 1956) appeared as an Army Corpsman in the Season 11 episode of M*A*S*H titled \"As Time Goes By\". Wesley's other TV series guest appearances include The White Shadow, The Larry Sanders Show, Boston Legal, and Seinfeld. He has degrees in Theater Arts from San Francisco State University & UCLA.\n\nBorn in Chicago, IL and raised in Pasadena, CA, Wesley began his career on the stage. He was voted Best Actor in college for his leading role in prolific playwright and director George C. Wolfe's very first play, \"Up For Grabs\". he's performed all over the Southland in such roles as Honey in \"A Member of the Wedding\" (with Virginia Capers), convicted felon Ice in Miguel Pinero's prison drama \"Short Eyes\", and in three long-running productions at West LA's Odyssey Theater: Filtch in Molière's \"The Miser\" with George Murdock, soldier McGlade in a Vietnam drama, \"The Bridgehead\", directed by Stephen Tobolowsky, and wisecracking relief pitcher Duke in the baseball comedy hit, \"Bullpen\", which moved, after its initial run, to Boston's Hasty Pudding Theater at Harvard. He has since gone on to do dozens of plays all over, but none as rewarding as his supporting role as the lovable loan shark Jumbo in the 2000 production of the romantic-comedy \"Panache\". It opened at the Pasadena Playhouse but within two months was swiftly moved to off-Broadway, to the Players Theater in Greenwich Village, in which The New York Times called Wesley \"an electric, on-stage presence\".\n\nHe was a series regular on two ABC programs: He's the Mayor (1986) and Pursuit of Happiness (1987). His most recent stints include Friends (1994), Providence (1999), Just Shoot Me! (1997), Malcolm in the Middle (2000) and recurring roles on ER (1994) and Grounded for Life (2001). He has been very fortunate to have done over 200 commercials over the years.\n\nHis first audition for film was for a low-budget drama intended as a documentary where the actors had to be believed as real people. The director, a young newcomer to feature filmmaking, hired him on the spot. The director, Taylor Hackford (\"An Officer and a Gentleman\", \"The Devil's Advocate\"). The film, \"Teenage Father\" (1978), won the Academy Award as Best Live Action Short. From there he has appeared such films as the Walter Hill film Brewster's Millions (1985) with Richard Pryor and John Candy, Gremlins 2: The New Batch (1990), directed by Joe Dante and working alongside Alfre Woodard in the Ivan Passer film Pretty Hattie's Baby (1991). Other film roles include the stage manager in L.A. Story (1991) with Steve Martin; Christina Ricci's teacher, Mr. Curtis, in the Brad Silberling-directed/Steven Spielberg-produced Casper (1995); as John Travolta's boss in Desmond Nakano's White Man's Burden (1995) with Harry Belafonte and the winner of the Discovery Award at the 1999 Toronto Film Festival, Smiling Fish & Goat on Fire (1999) produced by Martin Scorsese. He was last seen with Vivica A. Fox in Two Can Play That Game (2001), written and directed by Mark Brown (writer of Barbershop (2002)).\n\n(mash wikia)","birthday":"1956-10-02","id":154158,"imdb_id":"nm0860838","name":"Wesley Thompson","place_of_birth":"Chicago, Illinois, U.S.A.","popularity":1.02,"profile_path":"/tElRlp4m2HCjL783fBXgviPfPMU.jpg","credits":{"cast":[{"id":243616,"title":"Teenage Father","character":"","original_title":"Teenage Father","poster_path":"/40hQhIay2pf5QkQeWdhmlqnFmqY.jpg","release_date":"1978-01-01","adult":false},{"id":8839,"title":"鬼马小精灵","character":"Mr. Curtis","original_title":"Casper","poster_path":"/2ah8fNJFZVU3vcXhU5xfAYi2eym.jpg","release_date":"1995-05-26","adult":false},{"id":120591,"title":"Bounty Tracker","character":"Desk Sergeant","original_title":"Bounty Tracker","poster_path":"/mhIdSoqrApBWw7AdQlmIQDTHEzr.jpg","release_date":"1993-05-05","adult":false},{"id":93550,"title":"Drew Peterson: Untouchable","character":"Principal","original_title":"Drew Peterson: Untouchable","poster_path":"/7wEb2NUd0tvm4Y3tj35eqsx3LTM.jpg","release_date":"2014-01-29","adult":false},{"id":68721,"title":"钢铁侠3","character":"Secret Service Agent","original_title":"Iron Man 3","poster_path":"/beHcxOJvRdFCCGRy2gE7pFPHte5.jpg","release_date":"2013-04-18","adult":false}],"crew":[]},"images":{"profiles":[{"file_path":"/lxOG0sJQcuTNoisaZex3zPjQZr4.jpg","width":360,"height":540,"aspect_ratio":0.66666666666667,"vote_average":0,"vote_count":0},{"file_path":"/tElRlp4m2HCjL783fBXgviPfPMU.jpg","width":300,"height":450,"aspect_ratio":0.66666666666667,"vote_average":5.312,"vote_count":1},{"file_path":"/zfZMBJrSpIcscWAPUFV3Y9kWILs.jpg","width":300,"height":450,"aspect_ratio":0.66666666666667,"vote_average":0,"vote_count":0}]},"external_ids":{"imdb_id":"nm0860838","tvrage_id":0}}