{"adult":false,"also_known_as":[],"biography":"Isabelle was born in Montreal, Quebec, Canada on April 19 to Marie-Anne and Jean-Pierre Champeau. She is the middle child of three girls. Isabelle's natural charm and beauty propelled her into the world of acting and modeling at the tender age of 17. Before long, she was hired for a series of commercials and she guest starred on several TV Shows. Isabelle's acting career began with a bang when she was handpicked from a crowd of over 500 teenagers to roller-blade in a McDonald's commercial. When Isabelle was 19, a talent scout selected her for a three-month modeling stint in Japan and later on in Spain. Although most of the assignments were print work, Isabelle spent one memorable week riding motorcycles for Kawasaki near Mount Fuji in Japan. Isabelle has always been a girl on the go. She loves yoga, soccer, swimming, rock climbing, skating, snorkeling, and dancing. She developed her team spirit through gymnastics and volleyball games. When Isabelle was in her early 20s, her parents divorced. A few years later, while she was completing a university degree, her estranged father developed cancer. Isabelle dedicated herself to nursing her ailing father. Education has always been a priority in her agenda. After a brief foray in science with a view to pursue veterinary studies, Isabelle took some courses in scriptwriting at Quebec University. Then she decided to pursue this passion and completed her BA in Communications Studies at Concordia University in Montreal. Isabelle further developed her interest in film by working as an assistant to her mentor Father Marc Gervais, a film analysis teacher, author and judge at the Cannes Film Festival. Next, she attended, The International Film and Video workshops in Rockport, Maine, USA. Three weeks after her arrival, Isabelle was offered an assistant teaching position. Shortly thereafter, she went to Los Angeles to study script analysis and acting with Judith Weston. In 2002, she acted and danced in \"The Best of Billy Joel\" music video, which appeared in Canada and the USA. She has been attending Warren Robertson theater workshops since 2002. In addition to acting, Isabelle is also interested in other facets of the entertainment industry. She has worked in casting for children's television shows (Caillou for PBS). And Isabelle has written, directed and produced documentaries, corporate videos, short films and a music video \"Red light\". She also is an assistant and location manager for photographers, TV Shows and films. In early 2007, Isabelle wrote, produced and had the lead role in The Valley - a short film based on a true story.","id":1330755,"imdb_id":"nm1569731","name":"Isabelle Champeau","place_of_birth":"Montreal, Québec, Canada","popularity":0.6,"profile_path":"/1dP6lB0NUBAIMszurSEZSOvVE2o.jpg","credits":{"cast":[{"id":81700,"title":"The Wool Cap","character":"Flight attendant","original_title":"The Wool Cap","poster_path":"/ewBiyKk0n0JxahVhTucbEnOYmvR.jpg","release_date":"2004-11-20","adult":false},{"id":13537,"title":"欲盖弥彰","character":"Journalist","original_title":"Shattered Glass","poster_path":"/1KHHNkrf8t15sXXF9d9TGq1T9jv.jpg","release_date":"2003-11-14","adult":false},{"id":41171,"title":"Noel","character":"Party Guest","original_title":"Noel","poster_path":"/bRsGCyrtu0Vbtm1IEoD4el0cdKb.jpg","release_date":"2004-11-12","adult":false},{"id":1271,"title":"斯巴达300勇士","character":"Mother at Market","original_title":"300","poster_path":"/tKtcWSa9OCXzhl8m2jf43Gqpcq1.jpg","release_date":"2007-03-07","adult":false},{"id":2567,"title":"飞行家","character":"Editor (uncredited)","original_title":"The Aviator","poster_path":"/jOKRLQ3GWpMobI9BwOVaNZA8fpv.jpg","release_date":"2004-12-17","adult":false},{"id":13183,"title":"守望者","character":"Foreign Newcaster","original_title":"Watchmen","poster_path":"/fW2SHli83BFlws7OCkATHrF7qFt.jpg","release_date":"2009-03-05","adult":false}],"crew":[]},"images":{"profiles":[{"file_path":"/1dP6lB0NUBAIMszurSEZSOvVE2o.jpg","width":563,"height":845,"aspect_ratio":0.66627218934911,"vote_average":0,"vote_count":0}]},"external_ids":{"imdb_id":"nm1569731","tvrage_id":0}}