{"adult":false,"also_known_as":[],"biography":"Donna Rusch was born and raised in Houston, Texas. Her first memory of wanting to be an actress was watching Mary Ann after school in reruns of L'île aux naufragés (1964). She took her first acting class in middle school and while attending South Houston High School, split her time between cheerleading and starring in plays such as \"Wait Until Dark\", \"A Company of Wayward Saints\", \"MacBeth and \"Little Women\". Donna graduated from the University of Houston with her Bachelor of Arts degree in Radio/TV/Film. She landed a job as a part-time Desk Assistant at the country's #1 All-News Radio Station, KTRH-740 AM, Houston. She quickly rose to become a Reporter, earning numerous local and statewide awards including \"Best News Series in Texas\" from UPI. After 3 years, Donna went to the smaller city of Beaumont, Texas to prime her television reporting skills. Soon she became the city's first female solo 10'clock weeknight News Anchor. But after nearly 4 years, her love of acting won out. Donna moved back to Houston and signed with top Texas Talent Agent, Jenny Bosby of the Pastorini-Bosby Talent Agency. On her first national commercial audition, Donna booked the job for Texaco Express Lube. For 17 years she worked without stopping, primarily in commercials, voiceover and as a spokeswoman for Industrial Films and Web Content for clients such as ExxonMobil, Shell, Compaq Computers, Continental Airlines and Chevron. A fun fact, before he became a star, Donna starred with Matthew McConaughey in a training film for Exxon Aviation. In 1995,Donna became Host of \"Texas Today\", a live daily morning show featuring Hollywood stars visiting the city,top chefs, book authors and a live band. In 2000, her first TV movie role was as a Reporter in Mortelle invasion (2000), directed by Tim Matheson, made famous by his Otter role in American College (1978). Donna also became known as \"Renee Rusch\", a traffic reporter on several radio stations and served time as a TV Traffic Anchor on both the NBC and CBS television affiliates. In 2011, Donna made the move to Los Angeles with her husband Craig Beisel and their two daughters. She quickly hooked into the Independent Film world with a lead role in the award-winning film Home from War(2012), accepted to Cannes 2013. She can be seen in co-star roles in TV episodes of Criminal Minds(2013) and Revenge(2013). She stars in the thriller The Channel (2015), set to be released in 2013. She has also booked National and Regional commercials for Curves, Sara Lee and Reliant Energy. Donna enjoys volunteering as an acting coach for stage productions by the \"Spotlight Academy for Students\", a ministry of Calvary Community Church in Westlake, California.  - IMDb Mini Biography","id":1439207,"imdb_id":"nm4016223","name":"Donna Rusch","place_of_birth":"Houston - Texas - USA","popularity":1.528,"credits":{"cast":[{"id":500705,"title":"A Horse from Heaven","character":"Diane","original_title":"A Horse from Heaven","poster_path":"/1czsAXl9sGD5eS7LlaA6qC7mihZ.jpg","release_date":"2018-06-09","adult":false},{"id":384687,"title":"The Channel","character":"Maggie","original_title":"The Channel","poster_path":"/xaIgsQwfT4EmTFwx3KFULEVW939.jpg","release_date":"2016-03-18","adult":false},{"id":458109,"title":"真相漩涡","character":"Margaret","original_title":"Spinning Man","poster_path":"/lvIIUOoY2PQRQ6syWchzkfNaXT1.jpg","release_date":"2018-04-06","adult":false},{"id":210577,"title":"消失的爱人","character":"Lauren Nevens","original_title":"Gone Girl","poster_path":"/AuCQKjJi8zZAWsx22Uc0EtqKtyP.jpg","release_date":"2014-10-01","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm4016223","tvrage_id":388320}}