{"adult":false,"also_known_as":["Ashley Cope","Ashley Rae Didion"],"biography":"Ashley Rae Didion was raised Ashley Rae Cope in the small town of Crane in Southwest Missouri. She is the daughter of George Cope, a former construction business owner; and Sandy Cope, a former country music singer. She has two younger sisters, Morgan and Cory Cope. Ashley grew up on a large farm near Branson, Missouri; a city where she performed on stage alongside her family for most of her childhood while also acting in several local commercials. During her time in high school, she participated in Crane High's drama program and during the summer before her senior year, took part in a summer drama course at the University of Southern California.\n\nAfter graduating high school, Ashley went on to attend Missouri State University to receive her degree in Business Entrepreneurship with an emphasis in the Spanish language. After one semester she left Missouri for Los Angeles where she lived and worked for six months before moving back to Missouri to complete her college education. While attending Missouri State she signed with an agency in Kansas City and continued to act and model in various commercials, short films, and print shoots.\n\nIn Ashley's junior year of college she studied abroad in London for a semester which began her life-long passion for travel. Once graduating from college, she moved to New Zealand where she resided for six months. While living in New Zealand, Ashley partook in many outdoor adventures. To fund herself she worked in a local surf shop and signed with an agency which allowed her to model in several print ads as well as perform as an industrial spokesperson for various New Zealand businesses.\n\nOnce back in the United States, Ashley moved to St. Louis, Missouri where she married her husband, Matthew Didion; a business manager for the growing enterprise of Karen Didion Originals. Ashley is now signed with Now Talent Management and continues to act and model in many local and semi national commercials as well as short films. In 2013, Ashley earned a speaking role in David Fincher's film \"Gone Girl,\" due to release in 2014.\n\n- IMDb Mini Biography By: AD","id":1439141,"imdb_id":"nm0178539","name":"Ashley Didion","place_of_birth":"Crane - Southwest Missouri - USA","popularity":0.6,"credits":{"cast":[{"id":210577,"title":"消失的爱人","character":"Friend 1","original_title":"Gone Girl","poster_path":"/AuCQKjJi8zZAWsx22Uc0EtqKtyP.jpg","release_date":"2014-10-01","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm0178539","tvrage_id":0}}