{"adult":false,"also_known_as":[],"biography":"Born Thomas Bennett Sim White in Edinburgh, Scotland, White was primarily known as a blues vocalist with a trademark gravel-voiced voice. In the 1960s he recorded with beat groups The Boston Dexters and then The Buzz, who recorded one single with record producer Joe Meek in 1966. In the 1970s, White was the first artist to sing live on Top of the Pops,[2] and he provided the vocals for Robbie Coltrane to mime to as Big Jazza McGlone in John Byrne's award-winning television series Tutti Frutti in 1987.\n\nMixed fortunes in the 1970s after the Boston Dexters split saw him hosting his own TV show on Scottish Television and performing in working men's clubs, followed by a spell when he returned to stonemasonry. He told The Scotsman: \"Everyone wanted me to be somebody else. I did a series for STV in the 1970s, my own show, and I ended up in a monkey suit – it was incredibly embarrassing – and doing working men's clubs. I got hooked into that, anything to make a living.\" During this time White was drinking heavily, a habit he kicked in 1980.[2]\n\nIn the same year White reformed the Dexters with a changing line-up that over the years included guitarist Jim Condie and jazz pianist Brian Kellock, with whom he also recorded a duet album. Billed as Tam White &amp; The Dexters, the band built up a solid and loyal following for their live appearances, which generally sold out. In addition to being \"a fixture\" at the Edinburgh Jazz And Blues Festival,[3] there were also support slots for many better-known blues artists including B.B. King, Al Green and Van Morrison.[4] As the Dexters split for a second time, collaborations with musicians such as guitarist Neil Warden, the harmonica player Fraser Speirs and bassist Boz Burrell eventually developed into a permanent lineup known as The Shoestring Band, who continued performing together either as a trio or a larger band until Burrell's death in 2006. After this White re-formed the Dexters.\n\nWhite began acting on television in 1990, playing John Maguire in The Wreck on The Highway by Colin MacDonald. His most notable appearances include Paper Mask, The Negotiator, Braveheart, Cutthroat Island, Orphans, and two roles in Taggart, once in 1992 and once in 2000. He also had roles in Rebus: Black and Blue, playing Rico Briggs, The Legend of Loch Lomond, Goodbye, Mr Steadman and Man Dancin'. His latest television appearance's was playing Tony Macrae in EastEnders in late 2003 and early 2004, followed by a brief stint in 2009 in the BBC Scotland soap, River City.\n\nA fitness enthusiast, he died of a heart attack after a gym session in Edinburgh on 21 June 2010.[5]","birthday":"1942-07-21","deathday":"2010-06-21","id":2480,"imdb_id":"nm0925495","name":"Tam White","place_of_birth":"Edinburgh, Scotland, UK","popularity":0.6,"credits":{"cast":[{"id":77288,"title":"Man Dancin'","character":"Johnny 'Bus Stop'","original_title":"Man Dancin'","release_date":"2004-02-20","adult":false},{"id":197,"title":"勇敢的心","character":"MacGregor","original_title":"Braveheart","poster_path":"/or1gBugydmjToAEq7OZY0owwFk.jpg","release_date":"1995-05-24","adult":false},{"id":1408,"title":"割喉岛","character":"Fleming","original_title":"Cutthroat Island","poster_path":"/hYdeBZ4BFXivdouxLfQGWNE6zRx.jpg","release_date":"1995-12-22","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm0925495","tvrage_id":0}}