{"adult":false,"also_known_as":["Francis Gilhooley"],"biography":"Frank Gilhooley grew up in the mining town of Loanhead in central Scotland. Having never dreamed of becoming an actor, he trained as a Landscape contractor starting his own business in the early nineties. Married since 1993 to childhood sweetheart Angela, who even went to the same primary school &amp; high school as Frank, and grew up just around the corner... they now have three young boys. Frank stumbled into acting in 2001 by Getting involved in the Edinburgh Theatre Workshops community play, and was swiftly selected to play Frank Rowley in John Godber's 'Up'n Under' in the Edinburgh festival in the same year. Having immediately signed with agent (PLA Associates) after the festival, it took over a year for Frank to get his 1st part... 'John' in 'One Last Chance', as one of James Cosmo's mobsters in the Scottish Higlands. Enjoying varying roles across the UK's film &amp; television spectrum since then, Frank has worked steadily increasing trade in an enjoyable and varying acting career. In 2007 he experienced working for the first time with director Ken Loach in his award-winning movie 'It's A Free World', where he threw the cat amongst the pigeons for award winning lead actress Keirston Wareing. In 2008 Frank attended the first ever Scottish Masterclass given by L.A.'s world famous acting teacher Bernard Hiller, where he was lucky enough to be invited to attend Mr Hillers Los Angeles masterclass later in the year, and had worked closely with Bernie his mentor ever since. Most recently, Frank worked on Case Histories with Jason Isaacs and Victoria Wood, and appeared in the summer of 2014 for James Gunn in Marvel's 'Guardians Of The Galaxy' as a violent inmate of the most infamous Galactic Penetentiary The Kyln. In the early part of 2015, Frank will appear as Torin in the global television serialization of the top selling Diana Gabaldon books... Outlander.  - IMDb Mini Biography","birthday":"1971-03-29","id":1405453,"imdb_id":"nm1888295","name":"Frank Gilhooley","place_of_birth":"Edinburgh - Scotland - UK","popularity":0.6,"credits":{"cast":[{"id":385299,"title":"Murder: The Third Voice","character":"","original_title":"Murder: The Third Voice","release_date":"2016-03-03","adult":false},{"id":7992,"title":"自由世界","character":"Derek","original_title":"It's a Free World...","poster_path":"/cygDVBYkPXZ7S0iWUfyGYv0j3UB.jpg","release_date":"2007-09-28","adult":false},{"id":77517,"title":"Festival","character":"Tattooed Man in Shop","original_title":"Festival","poster_path":"/kM8d8ML5iqp6RuiITWSPA75xDCk.jpg","release_date":"2005-07-15","adult":false},{"id":118340,"title":"银河护卫队","character":"Burly Prisoner","original_title":"Guardians of the Galaxy","poster_path":"/sg1MnvxpdXn0ylkZCD6GMxNUkyO.jpg","release_date":"2014-07-30","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm1888295","freebase_mid":"/m/0gdk9bw","tvrage_id":125092}}