{"adult":false,"also_known_as":["John Wesley Chatham "],"biography":"Wes Chatham was born October 11, 1978 and grew up in North Georgia. Wes's parents divorced when he was two and he spent most of his childhood with his Mom, sister and brother. On a whim, Wes's mother took his sister to a audition for a Tide commercial in Savannah, Georgia and brought Wes along. While waiting for his sister in the lobby, the casting director discovered Wes and at the age of five, he was offered a national campaign for Tide.  At the age of thirteen, Wes moved in with his father and without a lot of supervision and as a restless and rebellious teen, he was kicked out of high school and sent to the Gift Center in Lawrencville, GA to finish school. The Gift Center was a second chance school for troubled youth, offering very small classes and a higher standard of education than public school. While attending classes, a professional theater company out of Atlanta started a mentoring program with the school and Wes was chosen to write a play that was later performed by his classmates. It was from this experience that Wes found his passion for the arts.  After graduating high school, Wes joined the military. He worked as an aviation firefighter on the flight deck of the USS Essex, working in crash and salvage for four years. Wes' break into acting came just three months before his tour was finished when Denzel Washington chose his ship to shoot the movie Antwone Fisher. While searching for some authentic military guys for the movie, Wes was discovered by casting director Robi Reed and given his first movie making experience. That's when he decided he wanted to pursue his life long dream of acting. Following Antwone Fisher, Robi convinced Wes to make the move to Hollywood and shortly thereafter cast him in his first series regular role on Showtime's Barbershop.  Wes really started to get attention when Paul Haggis cast him along side Tommy Lee Jones as Corporal Steve Penning in In the Valley of Elah. Tommy Lee Jones was nominated for the Academy Award for Best Actor for his role.  In 2009, Wes would go on to work with Oliver Stone in W. as Frank Benedict, George W's Fraternity brother. The following year, Wes landed another series regular role on CBS' hit TV show The Unit as new Unit team member Staff Sergeant Sam McBride aka Whiplash, working with David Mamet and Shawn Ryan. Wes also starred as Brian Danielson in Brett Simmons' Husk.  In 2011, Wes's was a part of the SAG Award Winning Ensemble Cast in DreamWork's The Help starring Emma Stone, Viola Davis, Octavia Spencer, Jessica Chastain, Allison Janney, Mike Vogel and Sissy Spacek. Cast in the role of Carleton Phelan, Wes played Emma Stone's brother in the film. In February 2012, the film received four Academy Award nominations including Best Picture, Best Actress for Viola Davis, Best Supporting Actress for Jessica Chastain and a win for Best Supporting Actress for Octavia Spencer.  In 2012, Wes landed his first title role in Joel Silver's The Philly Kid. A fan of mixed martial arts, Wes really dived into the character of Dillion McGwire, performing all of his own stunts. The film debuted in theaters May of 2012. Following The Philly Kid, Wes starred in This Thing With Sarah, which was recently accepted to the San Diego Film Festival.  In 2013 Wes wrapped two studio films, Broken Horses and The Town That Dreaded Sundown. Both are due in theaters late 2013 early 2014.","birthday":"1978-10-11","id":51682,"imdb_id":"nm1434871","name":"Wes Chatham","place_of_birth":"Georgia, USA","popularity":1.166,"credits":{"cast":[{"id":56906,"title":"外壳","character":"Brian","original_title":"Husk","poster_path":"/eSZfVXa9cDbc0FbkQ0tnSuPRMM9.jpg","release_date":"2011-01-28","adult":false},{"id":102222,"title":"The Philly Kid","character":"Dillon","original_title":"The Philly Kid","poster_path":"/pN0UFnqzkIFjmhH8ICKVAqxNBdo.jpg","release_date":"2012-05-11","adult":false},{"id":255497,"title":"This Thing with Sarah","character":"Ethan","original_title":"This Thing with Sarah","poster_path":"/yBxDo6qoHRHGDX2W2CVHYC1JcNh.jpg","release_date":"2013-06-01","adult":false},{"id":440471,"title":"金蝉脱壳2：冥府","character":"Jaspar Kimbral","original_title":"Escape Plan 2: Hades","poster_path":"/orD4KAgltcFMICKwzh2tscsGag1.jpg","release_date":"2018-06-05","adult":false},{"id":345923,"title":"我所看到的都是你","character":"Daniel","original_title":"All I See Is You","poster_path":"/8QtMqFW5ZEZnfK7fIr0fPfMERmM.jpg","release_date":"2016-09-14","adult":false},{"id":319910,"title":"Broken Horses","character":"Ace","original_title":"Broken Horses","poster_path":"/ra2Tusc9hNQSbXXPjQHxMGp9eKK.jpg","release_date":"2015-03-15","adult":false},{"id":6973,"title":"决战以拉谷","character":"Corporal Penning","original_title":"In the Valley of Elah","poster_path":"/aQx5vOURCo4SD71s7BBJIozGmt3.jpg","release_date":"2007-08-31","adult":false},{"id":287084,"title":"杀出魔鬼镇","character":"Danny","original_title":"The Town that Dreaded Sundown","poster_path":"/byiRbRiVZrQzjAs088qxG3PldCx.jpg","release_date":"2014-10-16","adult":false},{"id":131631,"title":"饥饿游戏3：嘲笑鸟（上）","character":"Castor","original_title":"The Hunger Games: Mockingjay - Part 1","poster_path":"/f1eUVoigp0BXAjIwPfgLHFWYzC7.jpg","release_date":"2014-11-19","adult":false},{"id":131634,"title":"饥饿游戏3：嘲笑鸟（下）","character":"Castor","original_title":"The Hunger Games: Mockingjay - Part 2","poster_path":"/bTLC6ghTfn3rZYdzVPaSXzlly14.jpg","release_date":"2015-11-18","adult":false},{"id":50014,"title":"相助","character":"Carlton Phelan","original_title":"The Help","poster_path":"/7XLSwxpfpPoJyTdJVot6a42TS2V.jpg","release_date":"2011-08-09","adult":false},{"id":22309,"title":"The Fighting Temptations","character":"Cashier","original_title":"The Fighting Temptations","poster_path":"/42JKjP2PSI6P9nJuUYBMSeLOgXT.jpg","release_date":"2003-09-17","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm1434871","freebase_mid":"/m/0gc5b1j","tvrage_id":0}}