[{"Title":"Emby for Apple TV - Improved playback and Live TV Guide","Link":"https://emby.media/community/index.php?/blog/1/entry-487-emby-for-apple-tv-improved-playback-and-live-tv-guide/","Description":"A new release of our Apple TV app is rolling out now with improved playback for native-supported formats (mp4) and a much-improved Live TV guide experience.  Should be hitting your devices soon.New Features&nbsp;Native Player&nbsp;We've re-introduced the native tvOS player back into Emby. The native player supports dynamic range and refresh rates that the MPV-based player currently doesn't support. The native player is enabled by default but you can enable MPV by going into the settings as shown below:&nbsp;Live TV Re-write&nbsp;We've re-written all the Live TV screens in the app which include a grid-based EPG, better image handling and general alignment with the features of the web app. Here's a sneak peek at the screens:&nbsp;&nbsp;Folder Screen Re-write&nbsp;We've re-written our folder screens to align with similar capabilities of the Movies, TV and Live TV libraries. You'll see higher quality images, better sorting, filtering, and navigation options among other capabilities:&nbsp;You'll also see similar improvements across other libraries like Music Videos.&nbsp;Added a Photo Player&nbsp;In previous versions of Emby you had to manually navigate photos and you had no way to play a slide show of photos. In this release we've added a photo player to simplify that process.&nbsp;Bug Fixes / Minor Improvements:Fixed a bug that prevented audio playback if there was no album artFixed a bug on the trailer detail view when there was no backdrop imageFixed a bug that had chevrons and checkmarks displaying incorrectly in dark mode across the appFixed a bug where if you were on the detail of an item, went to the home screen and selected that same item in the Top Shelf it'd add another detail view to the stack and make you have to back out twice to dismiss itFixed a bug where Remember Me wouldn't properly toggleFixed a bug where the Resume button image wouldn't display after stopping and the detail screen refreshesFixed a bug where the Top Shelf would be empty while a recording was in progress when the recording was in the Movies libraryFixed a bug where a Movie Trailer view wouldn't load if it didn't have a background imageFixed a bug where the proper image for the Live TV library wouldn't showRemember Me changes now take effect the next time the app restarts to minimize the impact when changing the settingImproved Home Screen refresh reliabilityImproved login flows for better reliabilityChanged the delete icon on the detail views to be a trash canChanged the artist icon on the album detail view to match the Apple artist iconChanged the select audio or versions icon to the Apple versions iconRemoved in-app restart capability due to a couple tvOS related bugs that result in the loss of refresh functionality","DescriptionHtml":"<p>A new release of our Apple TV app is rolling out now with improved playback for native-supported formats (mp4) and a much-improved Live TV guide experience.  Should be hitting your devices soon.<br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span  style='font-size: 24px'>New Features</span></p><p>&nbsp;</p><p><span  style='font-size: 18px'>Native Player</span></p><p>&nbsp;</p><p>We've re-introduced the native tvOS player back into Emby. The native player supports dynamic range and refresh rates that the MPV-based player currently doesn't support. The native player is enabled by default but you can enable MPV by going into the settings as shown below:</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5eb4284e2e1be_EnableMpv.gif' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 18px'>Live TV Re-write</span></p><p>&nbsp;</p><p>We've re-written all the Live TV screens in the app which include a grid-based EPG, better image handling and general alignment with the features of the web app. Here's a sneak peek at the screens:</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5eb428759fb07_LiveTv.gif' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 18px'>Folder Screen Re-write</span></p><p>&nbsp;</p><p>We've re-written our folder screens to align with similar capabilities of the Movies, TV and Live TV libraries. You'll see higher quality images, better sorting, filtering, and navigation options among other capabilities:</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5eb4289349d05_Folders.gif' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>You'll also see similar improvements across other libraries like Music Videos.</p><p>&nbsp;</p><p><span  style='font-size: 18px'>Added a Photo Player</span></p><p>&nbsp;</p><p>In previous versions of Emby you had to manually navigate photos and you had no way to play a slide show of photos. In this release we've added a photo player to simplify that process.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Bug Fixes / Minor Improvements:</span></span></span><ul class='bbc'><li>Fixed a bug that prevented audio playback if there was no album art</li><li>Fixed a bug on the trailer detail view when there was no backdrop image</li><li>Fixed a bug that had chevrons and checkmarks displaying incorrectly in dark mode across the app</li><li>Fixed a bug where if you were on the detail of an item, went to the home screen and selected that same item in the Top Shelf it'd add another detail view to the stack and make you have to back out twice to dismiss it</li><li>Fixed a bug where Remember Me wouldn't properly toggle</li><li>Fixed a bug where the Resume button image wouldn't display after stopping and the detail screen refreshes</li><li>Fixed a bug where the Top Shelf would be empty while a recording was in progress when the recording was in the Movies library</li><li>Fixed a bug where a Movie Trailer view wouldn't load if it didn't have a background image</li><li>Fixed a bug where the proper image for the Live TV library wouldn't show</li><li>Remember Me changes now take effect the next time the app restarts to minimize the impact when changing the setting</li><li>Improved Home Screen refresh reliability</li><li>Improved login flows for better reliability</li><li>Changed the delete icon on the detail views to be a trash can</li><li>Changed the artist icon on the album detail view to match the Apple artist icon</li><li>Changed the select audio or versions icon to the Apple versions icon</li><li>Removed in-app restart capability due to a couple tvOS related bugs that result in the loss of refresh functionality</li></ul></p>","Date":"2020-05-20T15:01:00.0000000Z"},{"Title":"Emby Theater for Windows Updated With Improved Performance, Better HDR, and More","Link":"https://emby.media/community/index.php?/blog/1/entry-486-emby-theater-for-windows-updated-with-improved-performance-better-hdr-and-more/","Description":"Emby Theater 3.0.11 is currently rolling out. Here are the highlights.&nbsp;Improved Performance&nbsp;Scrolling performance in the app has improved considerably. The paging buttons are gone and you can now easily flick your way through large lists. The A-Z pickers have also been improved and will help you scroll through large libraries more easily.&nbsp;Better HDR&nbsp;Backed by mpv 0.32, HDR playback has improved considerably in this new release.&nbsp;Other ImprovementsNew Black theme optionRedesigned menu for add to Playlist and add to Collection&nbsp;InstallationWindows Desktop: https://emby.media/emby-theater.html&nbsp;","DescriptionHtml":"<p>Emby Theater 3.0.11 is currently rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Improved Performance</span></p><p>&nbsp;</p><p>Scrolling performance in the app has improved considerably. The paging buttons are gone and you can now easily flick your way through large lists. The A-Z pickers have also been improved and will help you scroll through large libraries more easily.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Better HDR</span></p><p>&nbsp;</p><p>Backed by mpv 0.32, HDR playback has improved considerably in this new release.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>New Black theme option</li><li>Redesigned menu for add to Playlist and add to Collection</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Installation</span><br />Windows Desktop: <a href='https://emby.media/emby-theater.html' class='bbc_url' title=''>https://emby.media/emby-theater.html</a></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/561bc276520b9_1.png' alt='Posted Image'  /></span></p>","Date":"2020-03-12T17:45:00.0000000Z"},{"Title":"Emby for LG Smart TVs 1.0.24 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-485-emby-for-lg-smart-tvs-1024-released/","Description":"A new release of Emby for LG is currently rolling out. Here are the highlights:&nbsp;Included In&nbsp;Now you can see what Playlists or Collections a Movie has been added to right from the Movie detail screen.&nbsp;&nbsp;Are You Still Watching?&nbsp;Now in the LG app, and configurable at the bottom of the playback settings screen.&nbsp;&nbsp;Other ImprovementsResolve ass/ssa subtitle crash on WebOS 4.0 +&nbsp;","DescriptionHtml":"<p>A new release of Emby for LG is currently rolling out. Here are the highlights:</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Included In</span></p><p>&nbsp;</p><p>Now you can see what Playlists or Collections a Movie has been added to right from the Movie detail screen.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d8e394126546_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Are You Still Watching?</span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Now in the LG app, and configurable at the bottom of the playback settings screen.</span></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d850b6403fe8_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Resolve ass/ssa subtitle crash on WebOS 4.0 +</li></ul></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db34169e11ba_Untitled.png' alt='Posted Image'  /></span></p>","Date":"2020-03-10T19:44:00.0000000Z"},{"Title":"Emby now available on Soundiiz","Link":"https://emby.media/community/index.php?/blog/1/entry-484-emby-now-available-on-soundiiz/","Description":"We're pleased to announce integration with Soundiiz !&nbsp;\nHow it Works&nbsp;\nOnce you have connected your Emby server to Soundiiz (be sure to have enabled external connection), it will be able to retrieve your audio playlists and also search in your library.&nbsp;\nSo that means you will be able to export your playlists from Emby to match them with Spotify, Apple Music (and many more, Soundiiz supports almost 40 music services) catalogs, having your playlists everywhere. Soundiiz also allows you to import playlists into Emby. We will match as much as possible your source data with tracks you have in your Emby audio library.&nbsp;\nSoundiiz also supports favorite Artists, Tracks and Albums ! &nbsp;\nHead on over to Soundiiz at https://soundiiz.com to try it out, and as always, please make sure to leave your feedback so that we can continue to improve your experience.&nbsp;","DescriptionHtml":"<p>We're pleased to announce integration with <a href='https://soundiiz.com/' class='bbc_url' title='External link' rel='nofollow external'>Soundiiz</a> !</p><p>&nbsp;</p><p>\n<span  style='font-size: 24px'>How it Works</span></p><p>&nbsp;</p><p>\n<span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Once you have connected your Emby server to <a href='https://soundiiz.com/' class='bbc_url' title='External link' rel='nofollow external'>Soundiiz</a> (be sure to have enabled external connection), it will be able to retrieve your audio playlists and also search in your library.</span></span></p><p>&nbsp;</p><p>\n<span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>So that means you will be able to export your playlists from Emby to match them with Spotify, Apple Music (and many more, Soundiiz supports almost 40 music services) catalogs, having your playlists everywhere. <a href='https://soundiiz.com/' class='bbc_url' title='External link' rel='nofollow external'>Soundiiz</a> also allows you to import playlists into Emby. We will match as much as possible your source data with tracks you have in your Emby audio library.</span></span></p><p>&nbsp;</p><p>\n<span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><a href='https://soundiiz.com/' class='bbc_url' title='External link' rel='nofollow external'>Soundiiz</a> also supports favorite Artists, Tracks and Albums ! </span></span></p><p>&nbsp;</p><p>\nHead on over to <a href='https://soundiiz.com' class='bbc_url' title='External link' rel='nofollow external'>Soundiiz</a> at <a href='https://soundiiz.com' class='bbc_url' title='External link' rel='nofollow external'>https://soundiiz.com</a> to try it out, and as always, please make sure to leave your feedback so that we can continue to improve your experience.</p><p>&nbsp;</p><p>\n<span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5e4c3e828c26c_5e4a52f79bf19_emby_on_soundiiz.png' alt='Posted Image'  /></span></p>","Date":"2020-02-18T19:38:00.0000000Z"},{"Title":"Emby for iOS Updated with Improved Performance, New Themes and More","Link":"https://emby.media/community/index.php?/blog/1/entry-483-emby-for-ios-updated-with-improved-performance-new-themes-and-more/","Description":"Emby for iOS 1.9.2 has been released. Here are the highlights:&nbsp;Improved Performance&nbsp;Scrolling performance in the app has improved considerably. The paging buttons are gone and you can now easily flick your way through large lists. The A-Z pickers have also been improved and will help you scroll through large libraries more easily.&nbsp;Other ImprovementsNew Black theme optionRedesigned menu for add to Playlist and add to CollectionVarious fixes and improvements for Camera Upload","DescriptionHtml":"<p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Emby for iOS 1.9.2 has been released. Here are the highlights:</span></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Improved Performance</span></span></span></p><p>&nbsp;</p><p>Scrolling performance in the app has improved considerably. The paging buttons are gone and you can now easily flick your way through large lists. The A-Z pickers have also been improved and will help you scroll through large libraries more easily.</p><p>&nbsp;</p><p><span  style='font-size: 24px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Other Improvements</span></span></span><ul class='bbc'><li><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>New Black theme option</span></span></li><li><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Redesigned menu for add to Playlist and add to Collection</span></span></li><li><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Various fixes and improvements for Camera Upload</span></span></li></ul></p>","Date":"2020-02-13T19:06:00.0000000Z"},{"Title":"Emby for Samsung Tizen Smart TV 1.0.72 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-482-emby-for-samsung-tizen-smart-tv-1072-released/","Description":"An update to Emby for Samsung Tizen Smart TV is currently rolling out. Here are the highlights.&nbsp;New Video OSD&nbsp;The new design features big buttons and big graphics, making it easier and more fun to use.&nbsp;&nbsp;&nbsp;New Audio OSDSimilar to the new Video OSD design, with different variations based on the type of screen you're playing from.&nbsp;&nbsp;Other ImprovementsVarious subtitle and playback improvementsImproved search feature","DescriptionHtml":"<p>An update to Emby for Samsung Tizen Smart TV is currently rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Video OSD</span></p><p>&nbsp;</p><p>The new design features big buttons and big graphics, making it easier and more fun to use.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d6ec7fd87376_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Audio OSD</span><br />Similar to the new Video OSD design, with different variations based on the type of screen you're playing from.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5dabfa9f4d6c4_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Various subtitle and playback improvements</li><li>Improved search feature</li></ul></p>","Date":"2020-01-31T20:10:00.0000000Z"},{"Title":"Major Update to our Android TV/Fire TV App - rolling out now","Link":"https://emby.media/community/index.php?/blog/1/entry-481-major-update-to-our-android-tvfire-tv-app-rolling-out-now/","Description":"The update for the Android TV and Fire TV apps rolling out now is a biggie. Lots of improvements in design, consistency and features so let's get right to it...&nbsp;New Home Screen&nbsp;&nbsp;The home screen is now much more consistent with the rest of the app and makes it much easier to get to features like search, settings, and switching between users as these are now at the top instead of all the way on the last row.&nbsp;&nbsp;Also, there is a new option in Display Settings called \"Enhanced Home Screen\". This is actually the old \"Show Info Panel\" option re-named because it now transforms the home screen into the same interface you've had in the library views - where you can easily see all the details for the selected item without having to navigate into its detail page.&nbsp;&nbsp;Global Favorites&nbsp;Long requested and finally available with this home screen design - a global favorites view for all your favorite items across all your libraries.&nbsp;&nbsp;New Audio Player Design&nbsp;The audio player interface has been totally re-vamped to be just like the new improvements on the other platforms. Bigger, simpler, more elegant.&nbsp;&nbsp;More Filtering in Grid Views&nbsp;The Movie and TV Show grid views now offer much more filtering capability. The quick toggles for favorite and unwatched are still there but you can also bring up a filter dialog with more of the options you are accustomed to in the web app (and more to come in later releases).&nbsp;&nbsp;Notice - you can also select multiple values from each of the filter categories.&nbsp;&nbsp;Edit/Download Subtitles&nbsp;Just sat down to watch something and realize it doesn't have the subs you need? Now edit, search for and download subtitles right from your couch (requires proper setup of Subtitle Downloaders).&nbsp;&nbsp;Other Fixes and Improvements&nbsp;In addition to all those great enhancements, the following items were added or addressed:Add \"included In\" row on detail screen showing collections, playlists, etc.Improve song displaySearch for Artists instead of Album Artists in searchUpdate ExoplayerImprove image loadingFix collections limited to certain number of itemsImplement \"play from here\" on video gridImplement \"add to playlist\" for most itemsAllow letter jump list to scrollOption to show labels or not on all grid viewsFix some views not reacting to deleted itemsFix a number of possible \"black screen on start\" issuesImplement standard genre grid for musicImprove \"On Now\" row to show more relevant channelsImplement ability to edit padding on individual scheduled recordingsFix unable to play item when audio cannot be mixed down locallyImplement seeking in audio playerFix chapter OSD display issueAdd support for direct play of m4aAdd 4K indicator to guideImplement \"My Media Small\" displayAdd separate resolution switching option (in addition to frame rate)Fix display of very long album/song names in list view","DescriptionHtml":"<p>The update for the Android TV and Fire TV apps rolling out now is a biggie. Lots of improvements in design, consistency and features so let's get right to it...</p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Home Screen</span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e289ee63e66f_newtabhome.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>The home screen is now much more consistent with the rest of the app and makes it much easier to get to features like search, settings, and switching between users as these are now at the top instead of all the way on the last row.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e289f73c2551_switchuser.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>Also, there is a new option in Display Settings called \"Enhanced Home Screen\". This is actually the old \"Show Info Panel\" option re-named because it now transforms the home screen into the same interface you've had in the library views - where you can easily see all the details for the selected item without having to navigate into its detail page.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e289622e852e_enhancedhome.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Global Favorites</span></p><p>&nbsp;</p><p>Long requested and finally available with this home screen design - a global favorites view for all your favorite items across all your libraries.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e289680461ff_globalfavs.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Audio Player Design</span></p><p>&nbsp;</p><p>The audio player interface has been totally re-vamped to be just like the new improvements on the other platforms. Bigger, simpler, more elegant.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e2897337d9da_newaudio.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>More Filtering in Grid Views</span></p><p>&nbsp;</p><p>The Movie and TV Show grid views now offer much more filtering capability. The quick toggles for favorite and unwatched are still there but you can also bring up a filter dialog with more of the options you are accustomed to in the web app (and more to come in later releases).</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e2897c7c1684_filters.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>Notice - you can also select multiple values from each of the filter categories.</p><p>&nbsp;</p><p></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Edit/Download Subtitles</span></p><p>&nbsp;</p><p>Just sat down to watch something and realize it doesn't have the subs you need? Now edit, search for and download subtitles right from your couch (requires proper <a href='https://support.emby.media/en/support/solutions/articles/44001848856' class='bbc_url' title=''>setup of Subtitle Downloaders</a>).</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e28987e3370e_editsubs.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Fixes and Improvements</span></p><p>&nbsp;</p><p>In addition to all those great enhancements, the following items were added or addressed:<ul class='bbc'><li>Add \"included In\" row on detail screen showing collections, playlists, etc.</li><li>Improve song display</li><li>Search for Artists instead of Album Artists in search</li><li>Update Exoplayer</li><li>Improve image loading</li><li>Fix collections limited to certain number of items</li><li>Implement \"play from here\" on video grid</li><li>Implement \"add to playlist\" for most items</li><li>Allow letter jump list to scroll</li><li>Option to show labels or not on all grid views</li><li>Fix some views not reacting to deleted items</li><li>Fix a number of possible \"black screen on start\" issues</li><li>Implement standard genre grid for music</li><li>Improve \"On Now\" row to show more relevant channels</li><li>Implement ability to edit padding on individual scheduled recordings</li><li>Fix unable to play item when audio cannot be mixed down locally</li><li>Implement seeking in audio player</li><li>Fix chapter OSD display issue</li><li>Add support for direct play of m4a</li><li>Add 4K indicator to guide</li><li>Implement \"My Media Small\" display</li><li>Add separate resolution switching option (in addition to frame rate)</li><li>Fix display of very long album/song names in list view</li></ul></p>","Date":"2020-01-27T13:25:09.0000000Z"},{"Title":"Announcing the new Emby Knowledge Base","Link":"https://emby.media/community/index.php?/blog/1/entry-480-announcing-the-new-emby-knowledge-base/","Description":"We are very excited to announce our brand new, fully searchable and organized, Knowledge Base!  It is available now at https://support.emby.media&nbsp;\n&nbsp;\nJust start typing what you are looking for in the search box and related articles will be suggested immediately. Or just navigate the sections to find what you are looking for.&nbsp;\n&nbsp;\nWe really think this will be a major improvement to helping you find answers to your questions and issues. If you find problems, incorrect information or any other issues with the new KB, please create a post on the support forums and we'll get it addressed.&nbsp;\nThanks as always for your support.","DescriptionHtml":"<p>We are very excited to announce our brand new, fully searchable and organized, Knowledge Base!  It is available now at <a href='https://support.emby.media' class='bbc_url' title=''>https://support.emby.media</a></p><p>&nbsp;</p><p>\n<span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e1f3ae70d815_kb1.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>\nJust start typing what you are looking for in the search box and related articles will be suggested immediately. Or just navigate the sections to find what you are looking for.</p><p>&nbsp;</p><p>\n<span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5e1f3b3ceecaa_kb2.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>\nWe really think this will be a major improvement to helping you find answers to your questions and issues. If you find problems, incorrect information or any other issues with the new KB, please create a post on the support forums and we'll get it addressed.</p><p>&nbsp;</p><p>\nThanks as always for your support.</p>","Date":"2020-01-16T13:20:04.0000000Z"},{"Title":"Emby Server 4.3.1 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-479-emby-server-431-released/","Description":"Emby Server 4.3.1 is currently rolling out to address a few small issues with our 4.3 release. Here are the highlights:Fix arm64 transcoding crashesFix stopping live streams killing recordingsFix m3u tuners with m3u8 sourcesFix photo downloadsFix missing PlaybackPositionTicks in PlaybackStart event (for Trakt plugin)Fix server uninstallerFix changing audio tracks when remote controlling another appAdd black theme optionImprove light theme","DescriptionHtml":"<p>Emby Server 4.3.1 is currently rolling out to address a few small issues with our 4.3 release. Here are the highlights:<ul class='bbc'><li>Fix arm64 transcoding crashes</li><li>Fix stopping live streams killing recordings</li><li>Fix m3u tuners with m3u8 sources</li><li>Fix photo downloads</li><li>Fix missing PlaybackPositionTicks in PlaybackStart event (for Trakt plugin)</li><li>Fix server uninstaller</li><li>Fix changing audio tracks when remote controlling another app</li><li>Add black theme option</li><li>Improve light theme</li></ul></p>","Date":"2019-12-18T18:04:00.0000000Z"},{"Title":"Version 1.4.3 of Apple TV App Released","Link":"https://emby.media/community/index.php?/blog/1/entry-478-version-143-of-apple-tv-app-released/","Description":"A new version of our Apple TV app is rolling out now. Your device should upgrade automatically. This version cleans up a few things and lays the groundwork for the next release which should have some long-awaited improvements. In this release:&nbsp;New Features / Improvements:Rebuilt the startup / login flow to better align with the other Emby applications. This should significantly improve the reliability of the startup / sign in process.Apple TV Top Shelf Improvements:Top Shelf is now updated when the app enters the foreground or when playback stops.Top Shelf sections have been updated to align with the other Emby applications (Continue Watching, Next Up, Latest Movies)Top Shelf images now match that of other Emby applications&nbsp;&nbsp;&nbsp;Home screen now dynamically adds the Continue Watching section when appropriateMovie Suggestions screen now dynamically adds the Continue Watching section when appropriateShows Suggestions screen now dynamically adds the Continue Watching section when appropriate&nbsp;Improved internationalization support on most screens. This includes significantly more languages as well as improving consistency in naming where possible.&nbsp;Bug Fixes:Fixed an issue where backdrop images weren't included in the Continue Watching section of the home screen of the appThe app will no longer make requests for images that don't exist. This would cause server logs to be polluted with errorsMovie images for the Continue Watching section on the home screen have been correctedFixed an issue where a loader would display when backing out of music playbackFixed a bug that prevented the Person Detail from displaying in newer server versions","DescriptionHtml":"<p>A new version of our Apple TV app is rolling out now. Your device should upgrade automatically. This version cleans up a few things and lays the groundwork for the next release which should have some long-awaited improvements. In this release:</p><p>&nbsp;</p><p><span  style='font-size: 18px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><strong class='bbc'>New Features / Improvements:</strong></span></span></span><ul class='bbc'><li>Rebuilt the startup / login flow to better align with the other Emby applications. This should significantly improve the reliability of the startup / sign in process.</li><li>Apple TV Top Shelf Improvements:</li><li>Top Shelf is now updated when the app enters the foreground or when playback stops.</li><li>Top Shelf sections have been updated to align with the other Emby applications (Continue Watching, Next Up, Latest Movies)</li><li>Top Shelf images now match that of other Emby applications</li></ul></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5de85321a9c6a_SimulatorScreenShotAppleTV4Kat1080p20191204at194319.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5de8532f8d447_SimulatorScreenShotAppleTV4Kat1080p20191204at194326.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><ul class='bbc'><li>Home screen now dynamically adds the Continue Watching section when appropriate</li><li>Movie Suggestions screen now dynamically adds the Continue Watching section when appropriate</li><li>Shows Suggestions screen now dynamically adds the Continue Watching section when appropriate</li></ul></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5de85456b47b7_SimulatorScreenShotAppleTV4Kat1080p20191204at194611.png' alt='Posted Image'  /></span></span></span><br /><ul class='bbc'><li>Improved internationalization support on most screens. This includes significantly more languages as well as improving consistency in naming where possible.</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 18px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><strong class='bbc'>Bug Fixes:</strong></span></span></span><ul class='bbc'><li>Fixed an issue where backdrop images weren't included in the Continue Watching section of the home screen of the app</li><li>The app will no longer make requests for images that don't exist. This would cause server logs to be polluted with errors</li><li>Movie images for the Continue Watching section on the home screen have been corrected</li><li>Fixed an issue where a loader would display when backing out of music playback</li><li>Fixed a bug that prevented the Person Detail from displaying in newer server versions</li></ul></p>","Date":"2019-12-05T12:50:22.0000000Z"}]