{"adult":false,"also_known_as":[],"biography":"Bývalá dětská hvězda českého filmu. K hraní se dostala jako většina dětí  a u hraní už zůstala. Ve druhé třídě, když jí bylo sedm let, si ji  vybrali na konkurz. Šlo o film natočený podle knihy Bohumila Říhy ADAM A  OTKA. Miriam dostala rovnou hlavní roli Otky. Adama hrál Jan Gottlieb.  Hrála v dětském seriálu TAJEMSTVÍ PROUTĚNÉHO KOŠÍKU, kde měla roli  Klárky.\n\nNavštěvovala dramatický kroužek při Lidové škole umění. V  hereckém vzdělání pokračovala na Státní konzervatoři v Praze. Strávila  rok v Hanáckém divadle v Jihlavě, čtyři roky v Divadle F.X. Šaldy v  Liberci. Pak se vrátila do Prahy.\n\nPracuje v rodinné firmě, která  se zabývá rozvozem lékařských přístrojů na měření CO2 v krvi. Založila  občanské sdružení AKCIE PŘÍRODY. Aktivně se věnuje ekologii.\n\nŘíká, že dnešní ekologická situace ji děsí. Je vdaná. Má dvě dcery, Annu  Marii a Mariannu.\n\nHrála ve dvou oscarových filmech. Dabovala  americký velkofilm AMADEUS režiséra Miloše Formana a ztvárnila malou  roli ve filmu KOLJA režiséra Jana Svěráka. Ta byla z časových důvodů  vystřižena, ale v titulcích se mělo objevit její jméno.\n\nV  současnosti můžeme její hlas slyšet při dabingu. Dabování se věnuje od  roku 1992. Dabovala mladou Romy Schneider, Jodi Foster nebo Jennifer  Aniston (Rachel v americkém seriálu Přátelé).","birthday":"1965-06-21","id":1546023,"imdb_id":"nm0161614","name":"Miriam Chytilová","place_of_birth":"Praha - Československo","popularity":0.617,"credits":{"cast":[{"id":371589,"title":"Adam a Otka","character":"Otka","original_title":"Adam a Otka","poster_path":"/2cM5WfJy2vbfFIXZMyZcm0dEdlN.jpg","release_date":"1973-12-07","adult":false},{"id":568629,"title":"Nepodepsaný knoflík","character":"mladá Zelená","original_title":"Nepodepsaný knoflík","poster_path":"/pV3Je41zWnxoFljUROtKZ0l4qoB.jpg","release_date":"2003-02-09","adult":false},{"id":279,"title":"莫扎特传","character":"Czechoslovakian Actor","original_title":"Amadeus","poster_path":"/tsqcwBp1jYZdcceXXoVEby0dZkt.jpg","release_date":"1984-09-06","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm0161614","tvrage_id":0}}