{"adult":false,"also_known_as":["Darsheel Safari","Darshil Safary"],"biography":"Born in the same city and on the same month as his family friend Aamir Khan, Darsheel Safary (born March 9, 1997 in Mumbai, India) is an Indian child movie actor primarily working on starring in Hindi Bollywood films. He is best known for his acclaimed portrayal of a dyslexic child in the 2007 film Taare Zameen Par (Like Stars on Earth), a drama film about a teacher, Ram Shankar Nikumbh (Aamir Khan) and a boy (Darsheel Safary) with learning disabilities share a special bond.\n\nDarsheel was born on March 9, 1997 in Mumbai, Maharashtra, India. His father, Mitesh Safary is a jeweler and his mother is Sheetal Safary. He had no acting experience prior to Taare Zameen Par. Growing up in Mumbai, he enrolled into Shiamak Davar's dance academy. He had never expected to be a movie actor at such a young age. His parents wanted him to be a businessman executive or a jewelry designer. He has a younger sister and resides in his hometown in Mumbai.\n\nIn 2007, Safary made his first big acting debut in Taare Zameen Par, playing the film's protagonist Ishaan Nandkishore Awasthi. Safary was discovered by script writer and creative director, Amol Gupte during fall 2006 when he was looking for a male lead for his film, Taare Zameen Par. After going through hundreds of auditions, Gupte found Safary at Shiamak Davar's dancing school, \"Summer Funk\". In choosing Safary, Gupte had a number of boys audition for a scene in which they would informally describe how they would \"bunk\" school after being given a few scenarios. He recalls, \"It was a tough call. But Darsheel has the mischief in his eyes to be Ishaan. Everyone just naturally gravitated towards him.\" Taare Zameen par was filmed from fall 2006 until spring of 2007. Darsheel, at this time was only nine years old and only about 4 feet tall. The child artiste of the film, had to face a lot of opposition from his school when he was shortlisted for the film. The fact that he would have to miss school for such a long period of time did not go down well with the school authorities. However, Aamir Khan insisted that only Darsheel play the character, so he came up with a solution to fix the problem. He personally assured the school authorities that Darsheel's studies wouldn't be hampered with. Aamir arranged for personal tuition for Darsheel all through the academic year so that he wouldn't miss his exams. He also funded his studies as well as his educational expenses. Before starring, Darsheel was a part of Shiamak Davar's dance troupe. During one of the classes, he saw a poster that read, \"Hunting for a naughty kid. If you're selected, you will get a chance to act with Aamir Khan.\" He thought that it would be great if he was able to act in the film. During the same class, Amole Gupte spotted him and asked him to go for an audition. Eventually, he got selected. Darsheel also got an Xbox 360 as a birthday gift from Aamir Khan on 9th March 2007, his tenth birthday. Following the film's release, he became the youngest nominee for Filmfare Award for the Best Actor. He couldn't make it because it was won by Shahrukh Khan for Chak de! India.","birthday":"1996-03-09","id":52764,"imdb_id":"nm2594301","name":"Darsheel Safary","place_of_birth":"Mumbai, India","popularity":0.6,"credits":{"cast":[{"id":7508,"title":"地球上的星星","character":"Ishaan Nandkishore Awasthi","original_title":"Taare Zameen Par","poster_path":"/8SBqDgcYoQHyJbD09ITpjM8MKsx.jpg","release_date":"2007-12-21","adult":false},{"id":37729,"title":"Bumm Bumm Bole","character":"Pinu","original_title":"Bumm Bumm Bole","poster_path":"/swVBv5JcuzWKunrxphKGPQOY1Vh.jpg","release_date":"2010-05-14","adult":false},{"id":138755,"title":"Zokkomon","character":"Kunal / Zokkomon","original_title":"Zokkomon","release_date":"2011-04-02","adult":false},{"id":121598,"title":"午夜之子","character":"Young Saleem","original_title":"Midnight's Children","poster_path":"/8QdVLTou1Gy7EWOzficZqiwnv49.jpg","release_date":"2012-10-26","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm2594301","tvrage_id":0}}