{"adult":false,"also_known_as":["Christina Alexandria","Tina Redmond"],"biography":"If you would have told 8 year old California grown Tina Redmond that she would grow up and become everything she loved to do as a child, she would have just laughed and said, she just wants to own her own business. At an early age she started designing doll clothes, mixing makeup colors, styling hair, lip syncing to her favorite songs on camera and creating story lines with her dolls and imaginary friends. Growing up as an only child gave her an enormous amount of room for creativity. After graduating high school she studied at several trade schools which led her to open her own business which was a fashion, beauty and entertainment company. She used her skills to design, cut hair, apply makeup, host events, work as a television production crew member and now an actress that has become Christina Alex. She is aware of what she wants in life in terms of her career direction. Christina is a trained improv actress, that is enjoys networking and learning. This actress has the determination, the discipline and the ability to succeed in whatever her heart desires. Essentially, any director looking to make the audience laugh, cry or frown Christina is the actress to give you a range of many characters.","id":1400270,"imdb_id":"nm5623550","name":"Christina Alex","popularity":0.6,"credits":{"cast":[{"id":312113,"title":"Black November","character":"Hostage","original_title":"Black November","poster_path":"/onBy6iJt3BX8MSc7GjzIRgE07oV.jpg","release_date":"2012-12-07","adult":false},{"id":339994,"title":"好邻居","character":"Court Stenographer","original_title":"The Good Neighbor","poster_path":"/tQ3rH2izYRCsVDRyVKwIG8Q34lt.jpg","release_date":"2016-09-16","adult":false},{"id":210577,"title":"消失的爱人","character":"Airport Passenger (uncredited)","original_title":"Gone Girl","poster_path":"/AuCQKjJi8zZAWsx22Uc0EtqKtyP.jpg","release_date":"2014-10-01","adult":false}],"crew":[]},"images":{"profiles":[]},"external_ids":{"imdb_id":"nm5623550","tvrage_id":0}}