{"adult":false,"also_known_as":["Leslie Hughes"],"biography":"Actress/Model Leslie A. Hughes was Born in Fort Dodge, IA. She has been gifted with a tremendous amount of talent and charisma. Her sophistication and grace has brought her into a prosperous acting career. At the age of seven, Hughes was relocated from her hometown and raised in Ruskin, FL. Upon her youth Hughes became passionate about the entertainment industry and fascinated with award shows. The speeches, performances, celebrities and above all else the journeys of the artists encouraged Hughes to put her best foot forward. Hughes passion started at a young age, debuting in theatre and choir performances at church and outside community performances. From performing on the theatre stage to runways, her talent naturally lead her onto television. She earned many spreads in magazines, newspapers, articles and appearances in films and commercials. Recognized for her most recent role as a contestant on ABC's The Bachelor, CW's 90210, and Nickelodeon's Kickin It. She has also logged airtime on a variety of networks from Fox, CBS, MTV, Bravo, Disney and Hallmark Channel, one can say Hughes is at the peak of her career. In addition, Hughes is an active volunteer of philanthropy work. Her involvement with Habitat for Humanity, the Children's Hospital, Children's Hunger Fund, and Compassion International are keen traits to her humility and success. Hughes love for community service work has sparked a special place in her heart and has high hopes to one day establish her own non-profit organization.","id":1816403,"imdb_id":"nm3370819","name":"Leslie A. Hughes","place_of_birth":"Fort Dodge, Iowa, USA","popularity":0.6,"profile_path":"/ihhstLzFqzYCICREPSEvSJvW5NF.jpg","credits":{"cast":[{"id":418437,"title":"难以忘怀","character":"Tessa's Friend","original_title":"Unforgettable","poster_path":"/jKyjJu3N0bcF9TzcyGLb0Nn6Uqq.jpg","release_date":"2017-03-06","adult":false},{"id":227159,"title":"恶老板2","character":"Hockey Fan (uncredited)","original_title":"Horrible Bosses 2","poster_path":"/boBOkwIqgrs8noxBUSDkkicKa4K.jpg","release_date":"2014-11-26","adult":false},{"id":210577,"title":"消失的爱人","character":"Police Administrator (uncredited)","original_title":"Gone Girl","poster_path":"/AuCQKjJi8zZAWsx22Uc0EtqKtyP.jpg","release_date":"2014-10-01","adult":false},{"id":77953,"title":"政坛混战","character":"Campaign Supporter (uncredited)","original_title":"The Campaign","poster_path":"/jMWjJ13sFTT07DwjNlqh8VY4sK6.jpg","release_date":"2012-08-09","adult":false}],"crew":[]},"images":{"profiles":[{"file_path":"/ihhstLzFqzYCICREPSEvSJvW5NF.jpg","width":500,"height":750,"aspect_ratio":0.66666666666667,"vote_average":0,"vote_count":0}]},"external_ids":{"imdb_id":"nm3370819","tvrage_id":0}}